[
  {
    "id": "ep_001",
    "title": "Episode 1",
    "summary": "思源 frantically searches for his homework assignment that's due today. He looks everywhere in his bedroom but can't find it. Panicking, he asks 思琪 for help. Together they retrace his steps from yesterday afternoon - checking the living room where he had a snack, the dining room where the family ate dinner, and even the backyard where he played with his toy car. 思琪 teaches him that being organized is important and helps him develop a system.\n\nFinally, 南珍 calls from the kitchen - she found the homework papers mixed in with yesterday's newspapers that she was about to recycle. 思源 is so relieved and grateful. 南珍 gently reminds him that everything needs its proper place. 思琪 suggests they make a special homework folder and designate one spot on the dining table as 思源's \"homework corner.\"\n\nThe episode ends with 思源 happily putting his completed homework in his new folder and placing it in his backpack right away. He promises to always put his homework in the same place from now on. The gentle lesson reinforces the importance of organization, responsibility, and the value of family members helping each other solve problems.",
    "date": "2026-02-05T17:28:20.972102"
  },
  {
    "id": "ep_002",
    "title": "Episode 2",
    "summary": "明浩 wakes up early on Saturday morning with a secret plan - today is 佳敏's birthday, but she doesn't know the family is planning a surprise party. He recruits 思源 and 思琪 to help keep their mother busy and distracted while 南珍 prepares her famous birthday noodles in the kitchen. The challenge? 佳敏 is very observant and always seems to know when something is going on.\n\nThroughout the morning, the children try various tactics to keep 佳敏 away from the kitchen. 思源 asks her to help find his toy in the backyard, while 思琪 requests help choosing an outfit in her bedroom. Each time 佳敏 starts walking toward the kitchen, someone jumps in with a new distraction. The comedy builds as the children's excuses become more creative and slightly ridiculous. Meanwhile, 南珍 is cooking up a storm, and delicious smells start filling the house, making it harder to keep the secret.\n\nJust when 佳敏 is getting suspicious and insists on going to the kitchen, the family yells 'surprise!' She walks in to find a beautiful setup with decorations, her favorite noodles, and a homemade birthday card from both children. 佳敏 is moved to tears, revealing she actually knew something was up but played along because she loved seeing her family work together. The episode teaches that sometimes the effort and love behind a surprise is more important than keeping it perfectly secret, and that family teamwork creates the best memories.",
    "date": "2026-02-05T18:49:22.555114"
  }
]